src/ExchangePlans/_DemoExchangeWithSubsystemsLibrary.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<ExchangePlan>
		<Properties>
			<Name>_DemoExchangeWithSubsystemsLibrary</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DocumentExportStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseFilterByCompanies</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ItemsExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReferentialInformationExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Items</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Companies</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/Enums/ExchangeObjectExportModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ExchangeObjectExportModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>UnloadAlways</Name>
					<Comment>Export without of applying filters.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportByCondition</Name>
					<Comment>Export with applying filters.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportIfNecessary</Name>
					<Comment>Export without of applying filters, but with control of reference integrity of exported data.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ExchangePlans/_DemoExchangeWithSubsystemsLibrary/Forms/NodesSetupForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// FORM EVENT HANDLERS

&AtClient
Procedure BeforeClose(Cancel, StandardProcessing)
	
	DataExchangeClient.SetupFormBeforeClose(Cancel, ThisForm);
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DataExchangeServer.NodesSetupFormOnCreateAtServer(ThisForm, Cancel);
	
	// Filling default values
	If Not ValueIsFilled(DocumentExportStartDate) Then
		DocumentExportStartDate = BegOfYear(CurrentSessionDate());
	EndIf;
	
	If Not ValueIsFilled(ItemsExportMode) Then
		ItemsExportMode = Enums.ExchangeObjectExportModes.UnloadAlways;
	EndIf;
	
	If Not ValueIsFilled(CounterpartyExportMode) Then
		CounterpartyExportMode = Enums.ExchangeObjectExportModes.UnloadAlways;
	EndIf;
	
	GetContextDetails();
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// FORM COMMAND HANDLERS

&AtClient
Procedure WriteAndClose(Command)
	
	UseFilterByCompanies = Not DataExchangeClient.AllRowsMarkedInTable(Companies);
	
	GetContextDetails();
	
	DataExchangeClient.NodeSettingsFormCloseFormCommand(ThisForm);
	
EndProcedure

&AtClient
Procedure EnableAllCompanies(Command)
	
	EnableDisableAllItemsInTable(True, "Companies");

EndProcedure

&AtClient
Procedure DisableAllCompanies(Command)

	EnableDisableAllItemsInTable(False, "Companies");

EndProcedure

////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

&AtClient
Procedure EnableDisableAllItemsInTable(Enable, TableName)
	
	For Each CollectionItem In ThisForm[TableName] Do
		
		CollectionItem.Use = Enable;
		
	EndDo;
	
EndProcedure

&AtServer
Procedure GetContextDetails()
	
	// document export start date
	If ValueIsFilled(DocumentExportStartDate) Then
		DocumentExportStartDateDetails = StringFunctionsClientServer.SubstituteParametersInString(
			NStr("en = 'Data will be synchronized starting from %1.'"),
			Format(DocumentExportStartDate, "DLF=DD")
		);
	Else
		DocumentExportStartDateDetails = NStr("en = 'Data will be synchronized without of filtering by date.'");
	EndIf;
	
	// filter by companies
	If UseFilterByCompanies Then
		CompanyDetails = NStr("en = 'By selected companies:'") + Chars.LF + UsedItems("Companies");
	Else
		CompanyDetails = NStr("en = 'By all companies.'");
	EndIf;
	
	ContextDetails = (""
		+ DocumentExportStartDateDetails
		+ Chars.LF
		+ Chars.LF
		+ CompanyDetails);
		
EndProcedure

&AtServer
Function UsedItems(TableName)
	
	Return StringFunctionsClientServer.GetStringFromSubstringArray(
			ThisForm[TableName].Unload(New Structure("Use", True)).UnloadColumn("Presentation"),
			Chars.LF);
	
EndFunction
